---
type: HermiteSplineTangents
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# HermiteSplineTangents

`Autodesk.Revit.DB.HermiteSplineTangents` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | HermiteSplineTangents | 2014 | `public HermiteSplineTangents ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | EndTangent | 2014 | `public XYZ EndTangent { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | StartTangent | 2014 | `public XYZ StartTangent { get ; set ; }` |